// ok
"use strict"; 
var a = [1, 2, -3, -4, 5, 6, 100, 8, 9, 10];
var n = a.length;//10
var tmp;
var m = 1;

/*a.pop();
a.unshift(0);
*/


for(var i = n; i >= 0; i--){
	a[i + m] = a[i];
	

	/*tmp = a[i + 1];
	a[i + 2] = tmp;
	a[i + 1] = a [i];// 1. -3 .5 .100 .9
	
	
			/*for(var j = 1; j < n; j+=2){	
			m = a[j + 1];
			a[j + 1] = a [j];
			a[j + 2] = m;
			
		}*/
	//a[i++];
}
a[0] = 0;
for(var k = 0; k < n; k++){	
	console.log(a[k]);
}
	/*tmp = a[i + 1];
	a[i + 1] = a[i];
	a[i + 2] = tmp;
	a[0] = 0;*/

//	a[i+=2];
/*Array79. Дан массив размера N. Осуществить сдвиг элементов массива вправо на одну позицию (при этом A1 перейдет в A2, A2 — в A3, ..., AN−1 — в AN, a исходное значение последнего элемента будет потеряно). Первый элемент
полученного массива положить равным 0.*/ 